package ProxiadWeek1.TaskTwoBrackets;

public class Main {
    /**
     * Даден е математически израз, съдържащ скоби. Целта е да се извадят всички по-малки изрази,
     * затворени в скобите.
     * <p>
     * Примерни входни данни: 1 + (2 - (2 + 3) * 4 / (3 + 1)) * 5
     * Очакван резултат:
     * (2 + 3)
     * (3 + 1)
     * (2 - (2 + 3) * 4 / (3 + 1))
     */


    public static void main(String[] args) {

     //   String expression =  "1 + (2 - (2 + 3) * 4 / (3 + 1)) * 5";
    //test

    }
}
